quantoxide: adjust `README`, WIP
Update workflow diagram with Mermaid syntax.
